# GetObjectVariableHandle

## Description
Returns the value of a VectorWorks object property.

```pascal
FUNCTION GetObjectVariableHandle(
				h     : HANDLE;
				index : INTEGER): HANDLE;
```

```python
def vs.GetObjectVariableHandle(h, index):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|   |
|index|INTEGER|   |

## Version
Availability: from VectorWorks12.0

## Category
* Object Info